app/controllers/products_controller.rb

  def index
    @products = Product.order(:name)
---
SELECT `products`.* FROM `products` ORDER BY `products`.`name` ASC